BL_snapshot/constant/physicalProperties
FoamFile { version 2.0; format ascii; class dictionary; object physicalProperties; }
viscosityModel  constant;
nu              [0 2 -1 0 0 0 0] 1.05e-6;
