BL_snapshot/0/T.orig
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    object      T;
}

// ************************************************************************* //

dimensions      [0 0 0 1 0 0 0];

internalField   nonuniform small random perturbation

boundaryField
{
    floor
    {
        type fixedValue;
        value uniform 310;
    }

    ceiling
    {
        type fixedValue;
        value uniform 290;
    }

    leftRight
    {
        type cyclic;
    }

    frontBack
    {
        type cyclic;
    }
}

// ************************************************************************* //
